app/controllers/api/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "username", "city", "province", "country", "age", "birthday", "weight_kg", "height_cm", "avatar_url", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"